# IsPipingSystemTypeId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Pipe..::..IsPipingSystemTypeId Method
Pipe Class See Also
---
Checks if given type is valid piping system type.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static bool IsPipingSystemTypeId(
	Document document,
	ElementId systemTypeId
)
```

Visual Basic
---
```text
Public Shared Function IsPipingSystemTypeId ( _
	document As Document, _
	systemTypeId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsPipingSystemTypeId(
	Document^ document,
	ElementId^ systemTypeId
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
systemTypeId
    Type: Autodesk.Revit.DB..::..ElementId ElementId of the piping system type to check.
# ### Return Value
True if the given systemTypeId is the piping system type, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace